tmp.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.ws1.com/">
	<soapenv:Header/>
	<soapenv:Body>
		<ser:doS2M>
			<subsmsisdn>0896643349</subsmsisdn>
			<PartnId>1182</PartnId>
			<mermsisdn>0896643349</mermsisdn>
			<transid>566666662</transid>
			<currency>CDF</currency>
			<amount>500</amount>
			<callbackurl></callbackurl>
			<message_s2m> </message_s2m>
		</ser:doS2M>
	</soapenv:Body>
</soapenv:Envelope>


